export default function PublicOffer () {
  return (
    <div className="bg-[#EFF4FF]">
      <div className="container max-w-4xl mx-auto md:p-12 p-6 bg-white rounded-lg shadow-md">
        <h1 className="text-3xl font-bold mb-4">Публичная оферта (предложение) на предоставление доступа к сервисам Irocket.kz</h1>
        <p className="mb-4">Условия использования Irocket.kz</p>
        <p className="mb-4">ТОО &quot;DEX&amp;CO&quot;, именуемое в дальнейшем «Исполнитель», с одной стороны, публикует настоящие Условия, являющиеся публичной офертой (предложением) по предоставлению доступа к Irocket.kz и иных сопутствующих услуг. Настоящее соглашение заключается между ТОО &quot;DEX&amp;CO&quot; и любым физическим или юридическим лицом. Условия могут быть изменены ТОО &quot;DEX&amp;CO&quot; без предварительного уведомления и согласования. Актуальная версия оферты в любое время доступна по адресу https://irocket.kz/. Пожалуйста, внимательно ознакомьтесь с данными условиями, т.к. любое использование irocket.kz означает полное принятие условий, описанных в данной публичной оферте.</p>

        <h2 className="text-2xl font-semibold mb-2">1. Термины и определения</h2>
        <p className="mb-2">1.1. Нижеприведенные термины используются в следующих значениях:</p>
        <p className="mb-2">1.2. irocket.kz (Сервис) – сайт, размещенный в сети Интернет по адресу www.irocket.kz или любой другой адрес в домене www.irocket.kz</p>
        <p className="mb-2">1.3. Пользователь (Клиент) - физическое и/или юридическое лицо, принявшее условия настоящего договора и/или пользующееся irocket.kz</p>
        <p className="mb-2">1.4. Услуга - подключение на определенный срок функциональных возможностей — irocket.kz, в соответствии с Тарифами и условиями настоящего договора.</p>
        <p className="mb-2">1.5. Аккаунт (Учетная запись) - уникальная учетная запись в irocket.kz, позволяющая зарегистрированному Пользователю использовать все ее доступные функции.</p>
        <p className="mb-2">1.6. Тариф (Пакет услуг) - совокупность функционала, предоставляемого Пользователю в течение оплаченного периода использования.</p>
        <p className="mb-2">1.7. Блокировка аккаунта – действия Исполнителя по прекращению доступа Пользователя к irocket.kz, сервисам irocket.kz, аккаунту Пользователя.</p>

        <h2 className="text-2xl font-semibold mb-2">2. Общие положения</h2>
        <p className="mb-2">2.1 Исполнитель предоставляет Пользователю доступ к данным irocket.kz на условиях платной подписки (абонентский договор).</p>
        <p className="mb-2">2.2 Пользователь понимает и соглашается с тем, что Исполнитель не берет на себя ответственность за использование Пользователем сервисов — irocket.kz, в том числе за своевременность, удаление, неверную доставку или невозможность хранения сообщений любому пользователю или персональных настроек.</p>
        <p className="mb-2">2.3 Пользователь несёт ответственность за получение доступа к irocket.kz, и понимает, что использование irocket.kz может быть сопряжено со сборами третьих лиц (например, оплата услуг Интернет-провайдера и т.п.). Пользователь сам целиком несёт ответственность за эти расходы. Кроме того, Пользователь несёт ответственность за всё оборудование, необходимое Пользователю для доступа к Сервису.</p>

        <h2 className="text-2xl font-semibold mb-2">3. Оплата услуг и отчетность</h2>
        <p className="mb-2">3.1. Стоимость Услуг определяется в соответствии с Тарифами на использование, расположенными по адресу: irocket.kz</p>
        <p className="mb-2">3.2. Исполнитель вправе в любое время в одностороннем порядке изменять Тарифы, обновляя информацию на сайте по адресу, согласно п.3.1 Договора, при этом стоимость Услуг за уже оплаченные Пользователем периоды доступа к Сервису изменению не подлежит.</p>
        <p className="mb-2">3.3. Доступ к Сервису оплачивается Пользователем на условиях 100% предоплаты.</p>
        <p className="mb-2">3.4. Датой оказания Услуг Исполнителем является дата осуществления подключения (продления) функциональных возможностей irocket.kz на срок, предоплаченный Пользователем. Исполнитель предоставляет Пользователю доступ к Сервису в течение 1 (одного) рабочего дня с даты поступления оплаты на счет Исполнителя.</p>
        <p className="mb-2">3.5. В течение пяти рабочих дней с даты оказания Услуг (подключения на определенный срок функциональных возможностей — irocket.kz, в соответствии с Тарифами и условиями настоящего договора) Исполнитель формирует и отправляет Пользователю посредством государственной информационной системы &ldquo;электронные счет-фактуры&rdquo; электронные Акт Выполненных Работ и счет-фактуру, в соответствии со стоимостью оказанных услуг.</p>
        <p className="mb-2">3.6. Услуги считаются оказанными надлежащим образом и принятыми Пользователем в указанном в Акте Выполненных работ объеме, если в течение пяти рабочих дней с момента предоставления Акта Выполненных работ и счет-фактуры Исполнитель не получил от Пользователя мотивированных письменных возражений.</p>
        <p className="mb-2">3.7. По истечении срока, указанного выше (пяти рабочих дней), претензии Пользователя относительно недостатков Услуг, в том числе по количеству (объему), стоимости и качеству не принимаются.</p>
        <p className="mb-2">3.8. Расходы банка Пользователя, в том числе банковская комиссия, по перечислению Пользователем денежных средств по данному Договору возлагаются на Пользователя.</p>

        <h2 className="text-2xl font-semibold mb-2">4. Условия использования сервиса</h2>
        <p className="mb-2">4.1. Регистрация в irocket.kz осуществляется Клиентом самостоятельно путем указания своих Учетных данных на странице регистрации: https://app.irocket.kz/register. Элементами, идентифицирующими Клиента в irocket.kz, являются номер телефона и пароль, указанные при регистрации (учетные данные).</p>
        <p className="mb-2">4.2. Номер телефона и пароль, используемые Пользователем для доступа к irocket.kz, Исполнителем не восстанавливаются. Восстановление пароля осуществляется Пользователем самостоятельно.</p>
        <p className="mb-2">4.3. Пользователь несет полную ответственность за действия и/или бездействие, приведшие к разглашению, потере, краже и т.п. его учетных данных и иной информации, индивидуализирующей Пользователя, а также за любые действия и/или бездействие третьих лиц, использующих учетные данные Пользователя. Исполнитель не несет ответственности за вышеуказанные действия Пользователя и/или третьих лиц, использующих его учетные данные.</p>
        <p className="mb-2">4.4. При использовании irocket.kz запрещаются любые действия, направленные на получение несанкционированного доступа к ресурсам серверов irocket.kz, учетным и иным данным других пользователей.</p>
        <p className="mb-2">4.5. Использование сервиса должно осуществляться Пользователем только для законных целей и законными способами с учетом законодательства РК.</p>
        <p className="mb-2">4.6. Пользователь обязуется не наносить ущерб программной оболочке, техническим и программным средствам, узловым машинам Сервиса irocket.kz и третьих лиц.</p>
        <p className="mb-2">4.7. Пользователь обязуется соблюдать авторские, исключительные и иные права на предоставляемые Исполнителем, irocket.kz и и/или третьими лицами программное обеспечение и документацию.</p>
        <p className="mb-2">4.8. Пользователь обязуется не предоставлять свои Учетные данные третьим лицам.</p>

        <h2 className="text-2xl font-semibold mb-2">5. Запрещенные действия</h2>
        <p className="mb-2">5.1. Пользователям irocket.kz запрещается вводить для анализа ключевые запросы, имеющие порнографическое содержание; описание запрещенных в РК товаров и услуг; информацию, способствующую развитию религиозных конфликтов.</p>
        <p className="mb-2">5.2. В случае обнаружения подобных запросов, связанных с Аккаунтом, Сервис имеет право незамедлительно и необратимо заблокировать Аккаунт Пользователя.</p>

        <h2 className="text-2xl font-semibold mb-2">6. Блокировка Аккаунта</h2>
        <p className="mb-2">6.1. Исполнитель оставляет за собой право блокировки Аккаунта в случае возникновения следующих ситуаций:</p>
        <p className="mb-2">6.1.1. Пользователь присылает более 1 запроса к функциональным страницам в 5 секунд на протяжении 30 секунд;</p>
        <p className="mb-2">6.1.2. Работа в сервисе с использованием одного Аккаунта ведется более чем с десяти IP адресов в течение 3 дней подряд;</p>
        <p className="mb-2">6.1.3. Работа в сервисе с использованием одного Аккаунта ведется с десяти и более IP адресов одновременно;</p>
        <p className="mb-2">6.1.4. Работа в сервисе с использованием одного Аккаунта ведется с одного браузера (может быть согласовано иное количество браузеров в индивидуальном порядке).</p>
        <p className="mb-2">6.1.5. Нарушение Пользователем пункта 5.1 настоящего Договора.</p>
        <p className="mb-2">6.1.6. Продажа, перепродажа, сдача в аренду и иные способы предоставления Сервиса irocket.kz третьим лицам.</p>
        <p className="mb-2">6.2. При блокировке аккаунта возврат денежных средств не осуществляется. В этом случае сумма полученной от Пользователя оплаты доступа к irocket.kz за период, не истекший на момент блокировки аккаунта, является штрафом за допущенные Пользователем нарушения раздела 6 настоящего Договора.</p>

        <h2 className="text-2xl font-semibold mb-2">7. Срок действия и прекращение</h2>
        <p className="mb-2">7.1. Настоящий договор вступает в силу с момента начала использования или регистрации Пользователя в irocket.kz и действует до исполнения сторонами своих обязательств.</p>
        <p className="mb-2">7.2. Для удаления Аккаунта Пользователю необходимо написать на контакты менеджеров письмо с требованием аннулировать аккаунт.</p>

        <h2 className="text-2xl font-semibold mb-2">8. Форс-мажор</h2>
        <p className="mb-2">8.1. Ни одна из Сторон не будет нести ответственности за неисполнение или задержку в исполнении каких-либо обязательств по настоящему Договору, за исключением обязательств оплаты в случае, если это неисполнение или эта задержка в исполнении вызваны обстоятельствами вне сферы контроля соответствующей Стороны, включая стихийные бедствия, войны, террористические акты, гражданские беспорядки, трудовые конфликты и т.д.</p>

        <h2 className="text-2xl font-semibold mb-2">9. Прочие условия</h2>
        <p className="mb-2">9.1. Пользователь использует irocket.kz на собственный страх и риск. Функционал сервиса предоставляется &laquo;как есть&raquo; и &laquo;по возможности&raquo;, при этом Пользователь самостоятельно принимает собственные коммерческие и управленческие решения. Пользователь на свой риск принимает возможные последствия таких решений и ни при каких обстоятельствах не требует возмещения убытков или упущенной выгоды от Исполнителя. Риски от коммерческой деятельности Пользователя и принятия им решений, совершения или не совершения им каких-либо действий не могут быть возложены на Исполнителя.</p>
        <p className="mb-2">9.2. Исполнитель, его сотрудники и партнеры не гарантируют, что:</p>
        <p className="mb-2">9.2.1. irocket.kz будет отвечать требованиям Пользователя;</p>
        <p className="mb-2">9.2.2. irocket.kz будет работать непрерывно, быстро, надежно и без ошибок;</p>
        <p className="mb-2">9.2.3. Результаты, полученные в процессе работы с irocket.kz, будут точными, надежными и достоверными; Пользователь принимает, что данные сервиса irocket.kz могут быть получены путем информации сторонних сайтов, размещенной в общем доступе, при этом Исполнитель не может гарантировать достоверность и полноту такой информации;</p>
        <p className="mb-2">9.2.4. Качество любых продуктов, услуг и информации, полученных в процессе взаимодействия с irocket.kz, будут отвечать ожиданиям Пользователя.</p>
        <p className="mb-2">9.2.5. Любые ошибки программного обеспечения irocket.kz могут и будут исправлены.</p>
        <p className="mb-2">9.3. В случае, если функциональные возможности Сервиса в течение действия настоящего Договора будут полностью отключены или недоступны, Пользователь вправе до окончания предоплаченного периода потребовать от Исполнителя увеличения срока оплаченного периода подписки, соразмерный количеству дней, в которые Сервис полностью был недоступен или отключен.</p>
        <p className="mb-2">9.4. Исполнитель не несет ответственности перед Пользователем за любой прямой, косвенный, случайный, специальный, опосредованный ущерб, включая, но не ограничиваясь, ущербом прибыли, имиджу, информации, а также другие материальные убытки.</p>

        <h2 className="text-2xl font-semibold mb-2">Реквизиты</h2>
        <p className="mb-2">ТОО &quot;DEX&amp;CO&quot;</p>
        <p className="mb-2">БИН: 230140039203</p>
        <p className="mb-2">Юр Адрес: Республика Казахстан, город Алматы, Карасай Батыр 162/1</p>
        <p className="mb-2">БИК: CASPKZKA</p>
        <p className="mb-2">КБе: 17</p>
        <p className="mb-2">Контактный телефон: +7 747 717 44 22</p>
        <p className="mb-2">Контактный email: irocket.kz@mail.ru</p>
      </div>
    </div>
  );
};