export default function PrivacyPolicy() {
  return (
    <div className="bg-[#EFF4FF]">
      <div className="container max-w-4xl mx-auto md:p-12 p-6 bg-white rounded-lg shadow-md">
        <h1 className="text-3xl font-bold mb-4">Политика конфиденциальности личных данных</h1>
        <p className="mb-4">Настоящая Политика конфиденциальности личных данных (далее – Политика конфиденциальности) является публичным договором, заключенным между успешным Интернет-магазином Товарищество с ограниченной ответственностью «DEX&CO» (Продавец) и Покупателем в соответствии со ст.387 Гражданского кодекса Республики Казахстан, на основании Закона Республики Казахстан. «О цифровых данных и их защите», применяются в отношении информации, отображают персональные данные Покупателей, которые Интернет-магазин http://www.irocket.kz (далее – Интернет-магазин) может получить о Покупателях во время пользования ими Интернет-сайтом. магазин.</p>
        <h2 className="text-2xl font-semibold mb-2">1. Определение терминов</h2>
        <p className="mb-2">1.1. Персональные данные - сведения, связанные с упрощением или определением на их основании исторических данных, зафиксированных на электронном, бумажном и (или) материальном носителе.</p>
        <p className="mb-2">1.2. Неличные данные - сведения, которые автоматически передаются в процессе просмотра покупателем рекламных блоков и при посещении страниц, на установленной статистической скриптовой системе: адрес запрашиваемой страницы, информация cookie, IP-адрес, информация о браузере, реферер которого (адрес следующей страницы), время доступа.</p>
        <p className="mb-2">1.3. Сбор цифровых данных - действия, направленные на получение цифровых данных.</p>
        <p className="mb-2">1.4. Обработка цифровых данных - действия, направленные на накопление, хранение, изменение, дополнение, использование, распространение, обезличивание, блокирование и использование цифровых данных.</p>
        <p className="mb-2">1.5. Защита государственных данных - комплекс мер, в том числе правовых, организационных и технических, государственных в целях, установленных Законом РК «О национальных данных и их защите».</p>
        <p className="mb-2">1.6. Интернет-магазин - Интернет-сайт, расположенный в формате г. и Алматы предоставляет адрес в сети Интернет http://www.irocket.kz, на котором представлены товары, предлагаемые Покупателям для оформления Заказов, а также условия оплаты и доставки этих Заказов Покупателям.</p>
        <p className="mb-2">1.7. Сервисы Интернет-сайта – все услуги, доступные для использования на сайте http://www.irocket.kz и поддоменах.</p>
        <p className="mb-2">1.8. Покупатель – пользователь Интернет-магазина.</p>
        <p className="mb-2">1.9. Продавец – Товарищество с ограниченной ответственностью «Dex&Co», являющееся авторитетным Интернет-магазином, БИН 230140039203.</p>
        <p className="mb-2">1.10. Файлы cookie — это небольшие текстовые файлы, которые в браузере записывают данные с посещенных сайтов покупателей. Файлы cookie представляют собой целый ряд функций, например, позволяют Покупателю эффективно перемещаться между страницами, запоминая его настройки и, таким образом, улучшают опыт взаимодействия с Интернет-сайтом http://www.irocket.kz.</p>
        <p className="mb-2">1.11. IP-адрес — уникальный сетевой адрес узла в компьютерной сети, построенный по протоколу IP, позволяющий определить местонахождение Покупателя. Интернет-магазин не отслеживает местоположение,</p>

        <h2 className="text-2xl font-semibold mb-2">2. Предмет политики конфиденциальности</h2>
        <p className="mb-2">2.1. Настоящая Политика конфиденциальности устанавливает Продавцом обязательства по неразглашению и режиму защиты конфиденциальности личных данных, которые Покупатель предоставляет по запросу Продавца при регистрации на сайте Интернет-магазина и/или при оформлении заказа на приобретение товара.</p>
        <p className="mb-2">2.2. Персональные данные, разрешенные для обработки в рамках настоящей Политики конфиденциальности, предоставляются Покупателем через форму запроса на сайте Интернет-магазина и включают в себя следующую информацию:</p>
        <p className="mb-2">2.2.1. фамилию, имя, отчество (отчество – по желанию) Покупателя;</p>
        <p className="mb-2">2.2.2. контактный телефон Покупателя;</p>
        <p className="mb-2">2.2.3. адрес электронной почты (e-mail);</p>
        <p className="mb-2">2.3. Любая иная персональная информация неоговоренная (история покупок, использование браузеров и операционных систем и т.д.) также обеспечивается надежному хранению и нераспространению выше, за исключением случаев, предусмотренных в п.4.3.2. и п.4.4. настоящая Политика конфиденциальности.</p>

        <h2 className="text-2xl font-semibold mb-2">3. Цели сбора и обработки ценных данных покупателей</h2>
        <p className="mb-2">3.1. Продавец собирает, обрабатывает и хранит только те персональные данные, которые необходимы для предоставления Сервисов и/или приобретения Покупателем Товара из каталога Интернет-магазина.</p>
        <p className="mb-2">3.2. Персональные данные Покупателя Продавец использует в целях:</p>
        <p className="mb-2">3.2.1. удостоверение покупателя для оформления заказа и/или заключения Договора о купле-продаже товаров;</p>
        <p className="mb-2">3.2.2. операции и расчеты с покупателями;</p>
        <p className="mb-2">3.2.3. доставка Покупателю товара;</p>
        <p className="mb-2">3.2.4. проведение статистических и иных исследований на основе неличных данных, а также оптимизация рекламных сообщений.</p>
        <p className="mb-2">3.3. Продавец не несет ответственности за сведения, предоставленные Покупателем на интернет-сайте в общедоступной форме.</p>
        <p className="mb-2">3.4. Продавец не несет ответственности за нарушения, которые Покупатель может привести к тому, что его логин и пароль стали известны третьему лицу.</p>

        <h2 className="text-2xl font-semibold mb-2">4. Права и обязанности стороны</h2>
        <p className="mb-2">4.1. Покупатель обязан:</p>
        <p className="mb-2">4.1.1. предоставлять информацию о финансовых данных, необходимую для использования в Интернет-магазине;</p>
        <p className="mb-2">4.1.2. вносить изменения, дополнять предоставленную информацию в случае обнаружения некорректных данных при использовании Интернет-магазина.</p>
        <p className="mb-2">4.2. Покупатель имеет право:</p>
        <p className="mb-2">4.2.1. доступ и редактирование информации о политических данных в любое время через веб-интерфейс, предоставляемый в рамках сервисов.</p>
        <p className="mb-2">4.3. Продавец обязан:</p>
        <p className="mb-2">4.3.1. использовать полученную информацию исключительно для целей, указанных в разделе 3 настоящей Политики конфиденциальности;</p>
        <p className="mb-2">4.3.2. Обеспечение конфиденциальной информации в тайне, не разрешать без письменного разрешения Покупателя передавать письменные данные, за исключением передачи данных в целях выполнения заказа Покупателя (курьерскими службами, организациями почтовой связи, банками и т.п.), а также уполномоченным государственным органом Республики Казахстан в порядке, установленном законодательством РК;</p>
        <p className="mb-2">4.3.3. принять меры предосторожности для защиты конфиденциальности личных данных Покупателя согласно порядку, обычно используемому для защиты такого рода информации.</p>
        <p className="mb-2">4.4. Продавец имеет право предоставлять доступ для сбора и анализа неличных данных Покупателей третьего лица для целей статистики и оптимизации рекламных сообщений. Использование неличных данных на третьей стороне регулирует их собственную политику конфиденциальности, и Интернет-магазин не несет ответственности за их использование.</p>

        <h2 className="text-2xl font-semibold mb-2">5. Прочие условия</h2>
        <p className="mb-2">5.1. Использование Покупателем Интернет-магазина означает его безоговорочное согласие с настоящей Политикой конфиденциальности и условиями обработки Продавцом персональных данных Покупателя.</p>
        <p className="mb-2">5.2. В случае несогласия с требованиями Политики конфиденциальности Покупатель должен прекратить пользование Сайтом, Интернет-магазином.</p>
        <p className="mb-2">5.3. Настоящая Политика конфиденциальности распространяется только на сайт Интернет-магазина http://www.irocket.kz и поддоменам. Интернет-магазин не несет ответственности за сайты третьих лиц, на которые Покупатель может перейти по ссылкам, доступным на сайте Интернет-магазина.</p>
        <p className="mb-2">5.4. Продавец, в силу специфики получения информации, не в последнюю очередь достоверность предоставленных покупателем статистических данных и не только проверяет их актуальность. Однако Продавец исходит из того, что Покупатель предоставляет достоверные персональные данные и поддерживает данные в актуальном состоянии. Вся ответственность, а также возможные последствия за предоставление недостоверных или неактуальных финансовых данных несёт Покупатель.</p>
        <p className="mb-2">5.5. Отключение файлов cookie может обеспечить невозможность доступа к частям сайта Интернет-магазина, требующую авторизации.</p>
        <p className="mb-2">5.6. Интернет-магазин сбора статистики об IP-адресах своих покупателей. Данная информация используется.</p>
      </div>
    </div>
  );
};
